#include "ForestTree.hpp"

/* =========================================================================== */
/* ============================== Конструкторы =============================== */
/* =========================================================================== */

// Конструктор с параметром
ForestTree::ForestTree(std::string timeName, size_t timeAge, Tipe timeTipe, double timeAmount): Tree(timeName, timeAge, timeTipe), amountOfWood(timeAmount)
{}

ForestTree::ForestTree(const ForestTree& rhs, double timeAmount):Tree(rhs), amountOfWood(timeAmount)
{

}

// Конструктор копирования
ForestTree::ForestTree(const ForestTree& rhs):Tree(rhs), amountOfWood(rhs.amountOfWood)
{}

//Деструктор
ForestTree::~ForestTree()
{}
/* =========================================================================== */



/* =========================================================================== */
/* ============================ Геттеры ====================================== */
/* =========================================================================== */

// Получение количества древесины
double ForestTree::getAmountOfWood() const
{
	return this->amountOfWood;
}
/* =========================================================================== */



/* =========================================================================== */
/* ================================= Сеттеры ================================= */
/* =========================================================================== */

// Установка количества древесины
void ForestTree::setAmountOfWood(double timeAmountOfWood)
{
	this->amountOfWood = timeAmountOfWood;
}
/* ======================================================================== */


/* =============================================== */
/* =================== Методы ==================== */
/* =============================================== */
void ForestTree::print() const
{
	std::cout  << "Forest tree" << '\t'<< name << '\t' << age << '\t' << "Deciduous" << '\t' << amountOfWood << '\n';
}

/* ======================================================================== */
